/*
wa.me/6282285357346
github: https://github.com/sadxzyq
Instagram: https://instagram.com/tulisan.ku.id
ini wm gw cok jan di hapus
*/

global.kuis = global.kuis ? global.kuis : {}
let handler  = async (m, { conn, usedPrefix }) => {

  let id = m.chat
  if (id in global.kuis) return conn.reply(m.chat, 'لا يزال هناك سؤال لم تتم الإجابة عليه في هذه الدردشة', global.kuis[id][0])
  global.kuis[id] = [
    await conn.reply(m.chat,`「 اختبار 」\n\nسؤال :\n${pickRandom(global.kuis)}\n\nالوقت : 30.00 ثانية\nمكافأة : 5000 خبرة`, m),
    kuis, 4,
    setTimeout(() => {
      if (global.kuis[id]) conn.reply(m.chat, `انتهى الوقت!\n\nحاول مرة أخرى في وقت لاحق`, m)
      delete global.kuis[id]
    }, 30000)
  ]
}
handler.help = ['kuis']
handler.tags = ['game']
handler.command = /^(kuis|اختبار)$/i
handler.disable = true

export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.kuis = [
'أي لاعب كرة قدم يزن 3 كجم؟',
'أي مغني أجنبي يحب ركوب الدراجات؟',
'أي مغني شعره ليس مستقيماً؟',
'أي مغني أجنبي من أصل إندونيسي؟',
'أي مغني أجنبي يجد صعوبة في البلع؟',
'أي مغني غالباً ما يفقد وعيه؟',
'أي حاكم يحب الغناء؟',
'أي نائب رئيس يشاهد البث المباشر كثيرًا؟',
'لماذا تتوقف الدراجة النارية عند إشارة المرور الحمراء؟',
'خمن أي حيوان يجيد السباحة؟',
'لماذا توضع الحجارة على قضبان السكك الحديدية؟',
'الجو غائم. هناك 5 أشخاص ولكن هناك مظلة واحدة فقط. كيف يمكنهم جميعًا تجنب المطر؟',
'أي دجاجة مزعجة؟',
'لماذا توجد كلمة "ENTER" على الكمبيوتر؟',
'أي مفتاح يمكن أن يجعل الناس يرقصون؟',
'أي شيء صغير يمكنه إخراج الناس؟',
'تعلم لغة الماندرين، ماذا تعني "الأرضية المبتلة"؟',
'ما هو نوع البق المخيف جدا؟',
'ما هو لون الريح؟',
'أي شيء يخرج عند تدويره؟',
'أي ليلة هي الأكثر رعباً وخوفاً؟',
'شخص يبحث عن شيء ما، يأتي نظيفًا ويعود مضروبًا. ماذا كان يبحث عنه حقًا؟',
'ترجم إلى اليابانية "لا يوجد مال"؟',
'ما هو الشيء الذي يبدأ بحرف الكاف وينتهي بحرف اللام، إذا سحبته اشتد وإذا تركته ارتخى؟',
'لماذا تتوقف السيارات والدراجات النارية عندما تكون الإشارة حمراء؟',
'يتجنبه الكثير من الناس على الرغم من أن جلده أبيض؟',
'لماذا يرتدي النينجا قطعة قماش لتغطية رؤوسهم؟',
'لماذا يجب قطع شجرة جوز الهند أمام المنزل؟',
'إذا نام يستيقظ. وإذا استيقظ ينام؟',
'ما هو المرض الذي يحب البشر الاحتفاظ به؟',
'أي قرد هو الأكثر إزعاجًا؟',
'ما الفرق بينك وبين اللوحة؟',
'ما الفرق بين الساعة 12:00 وأنت؟',
'أي حافلة هي الأسعد؟',
'أي شيطان هو الأكثر رومانسية؟',
'أي سحلية يمكن أن تقتلني؟',
'أي قهوة هي الأكثر مرارة؟',
'أي سكة حديد هي الأكثر إيلاما؟',
'أي عمود لذيذ؟',
'هل تعرف لماذا برج بيزا مائل؟',
'أي حليب جميل؟',
'ما هو اختصار كلمة "الجمعة"؟',
'أي سحابة تجعلك سعيدًا؟',
'أي فاكهة هي الأغنى؟',
'ما هي الوجبة الخفيفة؟',
'أيهما أسبق، البيضة أم الدجاجة؟',
'أيهما أسبق، البيضة أم الدجاجة؟',
'أيهما أسبق، البيضة أم الدجاجة؟',
'يطلق النار على الأرض لكنها تصيب الأنف، ما هو؟',
'أي جندي هو الأصغر؟',
'ما هو القاسم المشترك بين المال والسر؟',
'ما الفرق بين الشمس والقمر؟',
'كيف تقول "لقد سُرقت" باليابانية؟',
'أي خزانة يمكن وضعها في الجيب؟',
'أي بطة تستمر في المشي إلى اليسار؟',
'هناك خمس دجاجات مضروبة في اثنين. كم عددها الإجمالي؟',
'لو كانت هناك مدرسة بها جميع أنواع الحيوانات، من سيتأخر في كثير من الأحيان؟',
'كم عدد أرجل أم أربعة وأربعين إذا انعطفت يسارًا؟',
'عندما تكون مغلقة تصبح عصا، وعندما تفتح تصبح خيمة. ما هي؟',
'من هو الشخص الذي يسبح ولكن شعره لا يبتل أبدًا؟',
'إذا أصبح الفيل دجاجة، والأسد دجاجة، والماعز دجاجة، فماذا تصبح الدجاجة؟',
'ما الفرق بين "العمل" و "التظاهر"؟',
'ما هو الحرف الخامس في الأبجدية؟',
'طائرة تتحطم، سفينة تغرق، أين تظهر؟',
'ما الفرق بين الأحذية و "الجينكول"؟',
'أيهما أثقل، 100 كجم من القطن أم 100 كجم من الحديد؟',
'ماذا يوجد في منتصف حقل الأرز؟',
]